<?
/*
   **********************************************************************
   *                                                                    
   *                                                                    
   *                                                                    
   *            ПЕРЕЧЕНЬ ЗАПРЕЩЕННЫХ СЛОВ ЧАТА                      
   *                                                                    
   *                                                                    
   *            (ищется вхождение слова в строку)                     
   *                                                                    
   *            Cлово может задаваться:
   *            с пробелами перед и спосле 
   *            и тогда оно ищется как нчало-конец слова
   *                                                                    
   *                                                                    
   *            Просьба удалить ваших детей от наших голубых экранов
   *
   *
   *                                                                    
   **********************************************************************
*/

global $StopWordList;
$StopWordList = array
 (
  " сука ",
  " сучка ",
  " суки ",
  " сучар",
  " сучий",

  "блядь ",
  " бляд",
  " бля ",

  "пизда",
  " пизд",

  " пидор",
  " пидар",
  "педерас",
  "пидорас",

  " на хуй ",
  " на х й ",
  "нахуй",

  " на хую",
  " на х ю",
  "нахую",

  " по хуй",
  " по х й",
  "похуй",

  " по хую",
  " по х ю",
  "похую",

  " хуй ",
  " хуй",
  " хуе",

  " хер",
  " херов",

  "ебать",
  "ебат",
  " еба",
  " ебтв",
  " еб тв",

  "ибать",
  " иба",

  "ибацц",

  "ебыват",

  " лох ",
  " лохи ",
  "лошара",

  "ублюд",

  " дрочит",

  " срать ",
  " насрать ",
  " сраны",
  " засран",

  " ссать ",
  " сцать ",
  " насса",
  " посса",
  " засса",
  " насца",
  " посца",
  " засца",
  " ссы ",
  " ссыкун",
  " сцыкун",
  " ссал ",
  " сцал ",

  " смарт ",

  "бздеть ",
  "бздун",

  "гандон",
  "гондон",

  "жопа",

  " додик"
 );

?>